{
  "description": "Этот файл содержит возможные вопросы и ответы к ним, касающиеся движка для бота RongoScript. Данные отформатированы так, чтобы использоваться в качестве тренировочного набора для @RuRongoBot бота построенного на RongoScript. Таким образом, @RuRongoBot бот натренированный на этом наборе сможет распознать вопрос о RongoScript и подобрать наиболее подходящийи ответ из существующего набора. Вы можете использовать структуру json документа использованную здесь для создания собственного набора данных для тренировки @RuRongoBot бота.",
  "samples":
  [
    {
    "class": 0,
    "utterance":["Что такое RongoScript?", "Для чего нужен RongoScript?", "Предназначение RongoScript?"],
    "response": ["Программное обеспечение, предназначенное для использования в качестве ядра бота, способного класифицировать пользовательские реплики по смыслу и выдавать подходящий ответ."],
    "ner": false,
    "action": null 
    },
    {
    "class": 1,
    "utterance":["Кто разработал RongoScript?", "Кто создал RongoScript?", "Кто тебя создал?", "Создатели RongoScript.", "Разработчики RongoScript."],
    "response": ["Небольшая группа энтузиастов, занимающихся нейросетями."],
    "ner": false,
    "action": null 
     },
    {
    "class": 2,
    "utterance":["Какие технологии и библиотеки использовались при разработке?", "На чем разрабатывался RongoScript?"],
    "response": ["Python, TensorFlow, SpaCy, Transformer"],
    "ner": false,
    "action": null 
     },
    {
    "class": 3,
    "utterance":["Какая технология используется для классификации фраз пользователя?", "Какая основная технология?"],
    "response": ["Трансформер"],
    "ner": false,
    "action": null 
     },
    {
    "class": 4,
    "utterance":["Где используется RongoScript? Где применяется RongoScript?", "Где устанавливался RongoScript?"],
    "response": ["RongoScript используется в @RuRongoBot демо боте в Telegram."],
    "ner": false,
    "action": null 
     },
    {
    "class": 5,
    "utterance":["Чем RongoScript лучше других?", "Чем RongoScript лучше DialogFlow?", "Почему нужно выбрать RongoScript?", "Преимущества RongoScript?"],
    "response": ["Развивающаяся разработка с использованием собственных инноваций. Позволяет вам самим сконфигурировать и натренировать лежащую в основе нейросеть."],
    "ner": false,
    "action": null 
     },
    {
    "class": 6,
    "utterance":["Ближайшие конкуренты RongoScript?", "Подобные продукты?", "Подобные разработки?", "С какими продуктами конкурирует RongoScript?"],
    "response": ["DialogFlow"],
    "ner": false,
    "action": null 
     }, 
    {
    "class": 7,
    "utterance":["Какие инновации используются в RongoScript?", "Какие новшества в RongoScript?", "Что нового в RongoScript?"],
    "response": ["В качестве быстрого примера: При обработке входных данных трансформером RongoScript использует эмбединг на основе синтаксических связей вместо классического позиционного. Еще одна идея, над которой мы работаем, — научить трансформер делать интерпретации, основанные не только на найденных в введенной фразе словах, но и учитывать контекст всей беседы, так чтобы трансформер мог «понимать» значение обрабатываемой фразы в зависимости от контекста, в котором она появилась."],
    "ner": false,
    "action": null 
     },
    {
    "class": 8,
    "utterance":["RongoScript открытый проект?", "Где найти код?", "Есть исходный код на GitHub?"],
    "response": ["Есть поддерживающая страница на GitHub объясняющая технические детали проекта, но исходный код на данный момент не выложен. Закрытый проект."],
    "ner": false,
    "action": null 
     },
    {
    "class": 9,
    "utterance":["Как связаться с разработчиками?", "Как найти разработчиков?", "Как выйти на разработчиков?", "Контакты разработчиков."],
    "response": ["Через страницу проекта на GitHub."],
    "ner": false,
    "action": null 
     },
    {
    "class": 10,
    "utterance":["Могу я протестировать RongoScript на моих данных?", "Можно использовать собственный набор данных?"],
    "response": ["@RuRongoBot бот позволяет вам протестировать RongoScript движок на ваших данных или использовать модель тренированную на FAQ наборе реализованном в сопровождающем faq.json файле."],
    "ner": false,
    "action": null 
     },
    {
    "class": 11,
    "utterance":["Что известно о DeepPavlov?", "Что нового о DeepPavlov?", "Какие новости о DeepPavlov?", "Что нового в Роснефть?"],
    "response": [""],
    "ner": true,
    "action": "get_news" 
     },
    {
    "class": 12,
    "utterance":["Что означает поле ner в тренировочном файле faq.json?", "Что такое поле ner в тренировочной записи?", "Для чего нужно поле ner?"],
    "response": ["Это поле показывает будет ли проводиться процедура распознавания именованных сущностей (ner) для данной записи. В случае true проводится замена имен сущностей на соответствующие им ner метки."],
    "ner": false,
    "action": null 
     },
    {
    "class": 13,
    "utterance":["Что означает поле action в тренировочном файле faq.json?", "Что такое поле action в тренировочной записи?", "Для чего нужно поле action?"],
    "response": ["Это поле показывает будет ли вызываться обработчик в виде функции для данной записи. Если при этом ner установлен в true, то в функцию будет передаваться словарь содержащий имена извлеченных из реплики сущностей и соответствующие им ner метки."],
    "ner": false,
    "action": null 
     },
    {
    "class": 14,
    "utterance":["Какие ограничения на количество записей в тренировочном наборе?", "Сколько можно иметь записей в тренировочном наборе?"],
    "response": ["В данной версии бота ограничение в 100 тренировочных пар. Ввиду небольших вычислительных возможностей сервера на котором он работает. Хотя сам RongoScript никаких ограничений такого рода не имеет."],
    "ner": false,
    "action": null 
     }, 
    {
    "class": 15,
    "utterance":["Как натренировать модель для тестирования RongoScript в боте?"],
    "response": ["Вы можете использовать готовую модель натренированную на  FAQ парах. Для этого используйте команду /train_faq. Чтобы натренировать модель на своих данных загрузите json файл как Документ со своими тренировочными парами. В этом случае создание модели начнется автоматически сразу после загрузки вашего файла."],
    "ner": false,
    "action": null 
     }
  ]
}
